# American Community Survey (2018)

In [1]:
dataset_id = "acs_2018_staging"

In [2]:
!bq --location=US mk --dataset {dataset_id}

BigQuery error in mk operation: Dataset 'sashimi-266523:acs_2018_staging'
already exists.

In [3]:
!bq --location=US load --autodetect --null_marker="(X)" --skip_leading_rows=1 --allow_quoted_newlines \
--source_format=CSV {dataset_id}.economics 'gs://acs-2018-deleted-row/economics.csv'

Waiting on bqjob_r3955f584f187f011_000001701ddf8005_1 ... (34s) Current status: DONE

In [4]:
!bq --location=US load --autodetect --null_marker="(X)" --skip_leading_rows=1 --allow_quoted_newlines \
--source_format=CSV {dataset_id}.housing 'gs://acs-2018-deleted-row/housing.csv'

Waiting on bqjob_r588146931d04790a_000001701de010fd_1 ... (34s) Current status: DONE

In [5]:
!bq --location=US load --autodetect --null_marker="(X)" --skip_leading_rows=1 --allow_quoted_newlines \
--source_format=CSV {dataset_id}.school_enrollment 'gs://acs-2018-deleted-row/school_enrollment.csv'

Waiting on bqjob_r4037ea7f8a35860d_000001701de0a036_1 ... (23s) Current status: DONE

In [6]:
!bq --location=US load --autodetect --null_marker=null --skip_leading_rows=1 --allow_quoted_newlines \
--source_format=CSV {dataset_id}.work 'gs://acs-2018-deleted-row/work.csv'

Waiting on bqjob_r6531fbd2e82c95bd_000001701de10381_1 ... (23s) Current status: DONE

# Explore data

## Economics

% of population 16+ yr old in the labor force vs. # of households have children

In [1]:
%%bigquery
select NAME, DP03_0002PE as Labor_Force, DP03_0004PE as Cilivilian_Labor_Force_Employeed, DP03_0005PE as Cilivilian_Labor_Force_Unemployeed, DP03_0014E as Children_In_HouseHold from acs_2018_staging.economics
where DP03_0014E is not null
order by DP03_0014E desc
limit 10

,NAME,Labor_Force,Cilivilian_Labor_Force_Employeed,Cilivilian_Labor_Force_Unemployeed,Children_In_HouseHold
0,ZCTA5 08701,56.1,52.6,3.5,19744
1,ZCTA5 11219,58.5,55.2,3.4,13296
2,ZCTA5 77449,75.2,71.1,4,11258
3,ZCTA5 11211,70.3,66.9,3.5,11100
4,ZCTA5 11368,67.5,64.3,3.3,10784
5,ZCTA5 90011,64.2,59.1,5.1,10701
6,ZCTA5 77494,67.4,64,3.4,10543
7,ZCTA5 11208,57.3,53.3,3.9,9942
8,ZCTA5 60629,65,54,10.9,9912
9,ZCTA5 79938,67.9,60.9,3.5,9832

Number of people in a given ZCTA area in a particular industry

In [6]:
%%bigquery
select NAME, DP03_0033E as Argiculture, DP03_0034E as Construction, DP03_0035E as Manufacturing, 
DP03_0036E as Wholesale, DP03_0037E as Retail, DP03_0038E as Transportation, DP03_0039E as Information, 
DP03_0040E as Finance_Real_Estate, DP03_0041E as Professional_Scientific_Management, 
DP03_0042E as Educational_Health_Care, DP03_0043E as Art_Entertainment, DP03_0045E as Public_Administration
from acs_2018_staging.economics
where DP03_0003E is not null
order by DP03_0003E desc
limit 10

,NAME,Argiculture,Construction,Manufacturing,Wholesale,Retail,Transportation,Information,Finance_Real_Estate,Professional_Scientific_Management,Educational_Health_Care,Art_Entertainment,Public_Administration
0,ZCTA5 77449,2008,3997,6224,3117,8117,4139,1044,3901,7171,11341,6508,1610
1,ZCTA5 77084,2025,4253,5671,2382,6712,3367,701,2976,7027,9761,4619,1217
2,ZCTA5 11385,87,5921,2570,1286,4953,4161,1396,3889,6346,11989,7175,1917
3,ZCTA5 11368,67,8591,2939,1296,5634,3740,828,1801,4174,7753,11218,1036
4,ZCTA5 60647,149,1436,4822,1407,4094,2379,1662,4423,10942,11163,7632,1236
5,ZCTA5 79936,490,2979,3498,1522,6434,3814,1102,2665,6313,12801,5478,3760
6,ZCTA5 60618,79,2091,4133,1235,4988,2961,1816,4814,9604,10054,7745,1324
7,ZCTA5 37013,46,3329,5005,1751,5861,3265,1464,3601,6546,12018,6460,1995
8,ZCTA5 11211,8,1089,1984,1577,5082,1251,4933,5188,12172,10174,5896,1215
9,ZCTA5 77494,5677,1503,6494,2185,3865,1933,1122,3392,8281,11637,3134,1158

% of people in a given area commute to work with certain ways

In [7]:
%%bigquery
select NAME, DP03_0019PE as Drive_Alone, DP03_0020PE as Carpooled, DP03_0021PE as Public_Transportation, 
DP03_0022PE as Walked, DP03_0023PE as Others, DP03_0024PE as Work_From_Home
from acs_2018_staging.economics
where DP03_0003E is not null
order by DP03_0003E desc
limit 10

,NAME,Drive_Alone,Carpooled,Public_Transportation,Walked,Others,Work_From_Home
0,ZCTA5 77449,83.3,10.4,1.2,0.3,1.1,3.6
1,ZCTA5 77084,81.1,10.5,1.6,1.4,1.1,4.3
2,ZCTA5 11385,26,4.3,59,7.1,1.5,2.2
3,ZCTA5 11368,16,5.1,65.5,9.8,2,1.6
4,ZCTA5 60647,44.8,5.2,33.8,3.5,6.7,6
5,ZCTA5 79936,83.2,11.5,0.4,0.9,0.8,3.1
6,ZCTA5 60618,48.5,8.9,29.1,3.7,3,6.8
7,ZCTA5 37013,80.9,13,0.8,0.8,1,3.6
8,ZCTA5 11211,9.6,2.3,62.5,14.8,3.8,6.9
9,ZCTA5 77494,79.1,9.5,3.3,0.4,1.4,6.3

Mean time travel to work in minutes

In [9]:
%%bigquery
select safe_cast(DP03_0025E as FLOAT64) as Mean_Travel_Time_To_Work
from acs_2018_staging.economics
where safe_cast(DP03_0025E as FLOAT64) is not Null
order by safe_cast(DP03_0025E as FLOAT64) asc
limit 10

   Mean_Travel_Time_To_Work
0                       1.0
1                       1.0
2                       2.9
3                       2.9
4                       3.0
5                       3.1
6                       3.2
7                       3.3
8                       3.4
9                       3.4

% of population in a given area falls into an income groups

In [10]:
%%bigquery
select NAME, DP03_0052PE as Income_less_10K, DP03_0053PE as Income_10K_14K, DP03_0054PE as Income_15K_24K, DP03_0055PE as Income_25K_34K, 
DP03_0056PE as Income_35K_49K, DP03_0057PE as Income_50K_74K, DP03_0058PE as Income_75K_99K, DP03_0059PE as Income_100K_149K, 
DP03_0060PE as Income_150K_199K, DP03_0061PE as Income_200K_more
from acs_2018_staging.economics
where DP03_0003E is not null
order by DP03_0003E desc
limit 10

,NAME,Income_less_10K,Income_10K_14K,Income_15K_24K,Income_25K_34K,Income_35K_49K,Income_50K_74K,Income_75K_99K,Income_100K_149K,Income_150K_199K,Income_200K_more
0,ZCTA5 77449,2.6,2,4.7,6.2,13.5,20.6,15.9,24.2,6,4.3
1,ZCTA5 77084,3.5,2.6,7.5,8.9,13,21.2,15.4,16.1,6.3,5.5
2,ZCTA5 11385,5.5,3.4,7.1,7.6,11.5,17,16,19.7,7.2,5.1
3,ZCTA5 11368,5.9,4.7,10.5,11.6,16.5,18.8,14.3,12.2,3.6,1.9
4,ZCTA5 60647,5.7,3.7,8.5,6.5,11.1,15.7,12.4,17.4,8,11
5,ZCTA5 79936,6.2,4.4,8.4,9.4,16.9,22.2,13,13,3.7,3
6,ZCTA5 60618,3.6,2.5,8.2,8.3,11.1,16.8,12.6,16.3,8.4,12.2
7,ZCTA5 37013,4.7,3.5,8.2,10.2,17.3,23.7,13.5,13,3.8,2.1
8,ZCTA5 11211,8,7.1,9.4,7.3,8.8,11,10.4,14.3,8.5,15.3
9,ZCTA5 77494,1.7,1.1,2,2.8,4.3,9.3,10.3,23.8,17.4,27.2

## Housing

% of housing that's occupied and % of housing vacant by ZCTA

In [12]:
%%bigquery
select NAME, DP04_0001E as Total_Housing_Units, DP04_0002PE as Occupied_Housing_Unites, DP04_0003PE as Vacant_Housing_Unites
from acs_2018_staging.housing
where DP04_0001E is not null
order by DP04_0002PE desc
limit 10

,NAME,Total_Housing_Units,Occupied_Housing_Unites,Vacant_Housing_Unites
0,ZCTA5 43739,801,99.9,0.1
1,ZCTA5 61015,400,99.8,0.3
2,ZCTA5 45362,445,99.8,0.2
3,ZCTA5 55071,2077,99.8,0.2
4,ZCTA5 49052,369,99.7,0.3
5,ZCTA5 98077,4700,99.7,0.3
6,ZCTA5 44721,5602,99.7,0.3
7,ZCTA5 84332,2403,99.7,0.3
8,ZCTA5 48191,1564,99.6,0.4
9,ZCTA5 80543,2541,99.6,0.4

% of housing in different types, ordered by % of RV, Boats

In [13]:
%%bigquery
select NAME, DP04_0006E as Total_Housing_Units, DP04_0007PE as Detached_Unit_1, DP04_0008PE as Attached_Unit_1, DP04_0009PE as Units_2, DP04_0010PE as Unites_3_4, 
DP04_0011PE as Unites_5_9, DP04_0012PE as Unites_10_19, DP04_0013PE as Unites_20_More, DP04_0014PE as Mobile_Home, DP04_0015PE as RV_Boat
from acs_2018_staging.housing
where safe_cast(DP04_0015PE as FLOAT64) > 0
order by safe_cast(DP04_0015PE as FLOAT64) desc
limit 20

,NAME,Total_Housing_Units,Detached_Unit_1,Attached_Unit_1,Units_2,Unites_3_4,Unites_5_9,Unites_10_19,Unites_20_More,Mobile_Home,RV_Boat
0,ZCTA5 98353,30,50,0,0,0,0,0,0,0,50
1,ZCTA5 98811,51,21.6,0,0,0,0,0,0,47.1,31.4
2,ZCTA5 89438,64,0,0,0,0,0,0,0,70.3,29.7
3,ZCTA5 63962,47,72.3,0,0,0,0,0,0,0,27.7
4,ZCTA5 57432,170,72.9,0,0,0,0,0,0,5.9,21.2
5,ZCTA5 82942,86,0,0,0,0,0,0,0,81.4,18.6
6,ZCTA5 70050,62,14.5,0,0,0,0,0,0,67.7,17.7
7,ZCTA5 81411,30,30,0,0,0,0,0,0,53.3,16.7
8,ZCTA5 45622,74,39.2,0,0,0,0,0,0,44.6,16.2
9,ZCTA5 91046,100,0,8,17,0,15,0,44,0,16
10,ZCTA5 72827,102,57.8,0,0,0,0,0,0,26.5,15.7
11,ZCTA5 45650,261,42.5,0,0,0,0,0,0,41.8,15.7
12,ZCTA5 98614,192,35.9,0,14.6,0,0,0,0,33.9,15.6
13,ZCTA5 59256,45,84.4,0,0,0,0,0,0,0,15.6
14,ZCTA5 92328,261,34.5,18.4,3.8,0.4,0,0,2.3,25.7,14.9
15,ZCTA5 83520,118,55.9,0,0,3.4,0,0,0,26.3,14.4
16,ZCTA5 66514,602,57.5,0,1,0,0.3,2.2,0,24.9,14.1
17,ZCTA5 25634,130,45.4,0,0,0,0,0,0,40.8,13.8
18,ZCTA5 99346,205,44.4,0,0,0,0,0,0,42,13.7
19,ZCTA5 25534,197,59.9,4.1,0,0,0,0,0,22.3,13.7

% of houses built within different periods of time, order by houses built later than 2014

In [14]:
%%bigquery
select NAME, DP04_0017PE as Built_2014_Or_Later, DP04_0018PE as Built_2010_2013, DP04_0019PE as Built_2000_2009, DP04_0020PE as Built_1990_1999, DP04_0021PE as Built_1980_1989, 
DP04_0022PE as Built_1970_1979, DP04_0023PE as Built_1960_1969, DP04_0024PE as Built_1950_1959, DP04_0025PE as Built_1940_1949, DP04_0026PE as Built_1939_Or_After
from acs_2018_staging.housing
where safe_cast(DP04_0017PE as FLOAT64) > 0
order by safe_cast(DP04_0017PE as FLOAT64) desc
limit 10

,NAME,Built_2014_Or_Later,Built_2010_2013,Built_2000_2009,Built_1990_1999,Built_1980_1989,Built_1970_1979,Built_1960_1969,Built_1950_1959,Built_1940_1949,Built_1939_Or_After
0,ZCTA5 33122,100,0,0,0,0,0,0,0,0,0
1,ZCTA5 10279,100,0,0,0,0,0,0,0,0,0
2,ZCTA5 13643,100,0,0,0,0,0,0,0,0,0
3,ZCTA5 10199,100,0,0,0,0,0,0,0,0,0
4,ZCTA5 55111,75,0,0,0,0,0,0,0,0,25
5,ZCTA5 30289,70.1,0,6.5,0,2.6,2.6,0,0,0,18.2
6,ZCTA5 68531,67.9,0,0,23.4,3.6,0,0,0,0,5.1
7,ZCTA5 68514,50,0,0,15.8,0,34.2,0,0,0,0
8,ZCTA5 86011,47.9,32.9,5.5,0,4.1,0,0,0,0,9.6
9,ZCTA5 68667,39.3,0,5.4,0,12.5,8.9,0,1.8,0,32.1

% of housing in a given range of housing value, order by highest % of housing value more than 1M

In [18]:
%%bigquery
select NAME, DP04_0081PE as Less_Than_50k, DP04_0082PE as V_50k_99K, DP04_0083PE as V_100K_149K, DP04_0084PE as V_150K_199K, DP04_0085PE as V_200K_299K, 
DP04_0086PE as V_400K_499K, DP04_0087PE as V_500K_999K, DP04_0088PE as V_1M_Or_More
from acs_2018_staging.housing
where safe_cast(DP04_0088PE as FLOAT64) > 0
order by safe_cast(DP04_0088PE as FLOAT64) desc
limit 100

,NAME,Less_Than_50k,V_50k_99K,V_100K_149K,V_150K_199K,V_200K_299K,V_400K_499K,V_500K_999K,V_1M_Or_More
0,ZCTA5 02199,0,0,0,0,0,0,0,100
1,ZCTA5 95494,0,0,0,0,0,0,0,100
2,ZCTA5 94104,0,0,0,0,0,0,0,100
3,ZCTA5 70801,0,0,0,0,0,0,0,100
4,ZCTA5 95721,0,0,0,0,0,0,0,100
...,...,...,...,...,...,...,...,...,...
95,ZCTA5 95129,0.4,0.1,0.6,0.3,0.5,2.6,22.6,73
96,ZCTA5 29482,1.9,0,0,1.3,1.6,1.3,21.1,72.6
97,ZCTA5 06840,0.8,0.1,0.5,1.5,2.1,5.1,17.5,72.4
98,ZCTA5 94946,0.9,0,0,1.8,0,2.3,22.7,72.3
99,ZCTA5 11030,1,0.3,0.2,0.5,0.4,1.4,23.9,72.3

## School Enrollment

explore about the numbers of school enrollment in categories for each ZCTA area

In [12]:
%%bigquery
select NAME, S1401_C01_004E as Kindergarden, S1401_C01_005E as Grade1_to_4, S1401_C01_006E as Grade5_to_8, S1401_C01_007E as Grade9_to_12, S1401_C01_008E as College_Undergrad, S1401_C01_009E as Grad_HigherEdu 
from acs_2018_staging.school_enrollment
where S1401_C01_004E is not null
order by NAME
limit 20

,NAME,Kindergarden,Grade1_to_4,Grade5_to_8,Grade9_to_12,College_Undergrad,Grad_HigherEdu
0,ZCTA5 00601,242,787,943,911,969,76
1,ZCTA5 00602,539,1624,1804,1770,2620,208
2,ZCTA5 00603,394,2050,2675,2587,2603,320
3,ZCTA5 00606,59,264,319,369,368,14
4,ZCTA5 00610,113,1112,1705,1195,1581,173
5,ZCTA5 00612,608,2507,2950,3512,3675,517
6,ZCTA5 00616,0,379,352,496,700,85
7,ZCTA5 00617,251,1015,1397,1228,1432,174
8,ZCTA5 00622,16,148,293,262,354,27
9,ZCTA5 00623,439,1880,2214,2398,2386,311
10,ZCTA5 00624,322,1387,1081,1267,1489,196
11,ZCTA5 00627,192,1452,1594,1612,1995,329
12,ZCTA5 00631,0,63,56,89,9,12
13,ZCTA5 00637,219,919,1226,1214,1184,175
14,ZCTA5 00638,180,886,792,875,702,42
15,ZCTA5 00641,226,1203,1302,1461,1620,58
16,ZCTA5 00646,376,1826,2219,2191,1962,477
17,ZCTA5 00647,26,215,304,202,312,23
18,ZCTA5 00650,135,713,688,921,900,33
19,ZCTA5 00652,23,193,312,261,180,0

explore about the school enrollment in college or higher for public school and private school

In [11]:
%%bigquery
select NAME, S1401_C03_008E as College_Undergrad_Public, S1401_C05_008E as College_Undergrad_Private, S1401_C03_009E as Grad_HigherEdu_Public, S1401_C05_009E as Grad_HigherEdu_Private from acs_2018_staging.school_enrollment
where S1401_C03_008E is not null
order by NAME
limit 20

,NAME,College_Undergrad_Public,College_Undergrad_Private,Grad_HigherEdu_Public,Grad_HigherEdu_Private
0,ZCTA5 00601,348,621,17,59
1,ZCTA5 00602,1116,1504,0,208
2,ZCTA5 00603,1281,1322,108,212
3,ZCTA5 00606,77,291,0,14
4,ZCTA5 00610,719,862,47,126
5,ZCTA5 00612,1474,2201,136,381
6,ZCTA5 00616,323,377,0,85
7,ZCTA5 00617,648,784,80,94
8,ZCTA5 00622,170,184,0,27
9,ZCTA5 00623,578,1808,68,243
10,ZCTA5 00624,506,983,18,178
11,ZCTA5 00627,1077,918,121,208
12,ZCTA5 00631,9,0,12,0
13,ZCTA5 00637,675,509,92,83
14,ZCTA5 00638,282,420,0,42
15,ZCTA5 00641,822,798,16,42
16,ZCTA5 00646,829,1133,49,428
17,ZCTA5 00647,248,64,23,0
18,ZCTA5 00650,416,484,0,33
19,ZCTA5 00652,42,138,0,0

explore about female and male ratio in school enrollment for college and higher education in public school and private school

In [15]:
%%bigquery
select NAME, S1401_C03_011E as Male_Public, S1401_C05_011E as Female_Public, S1401_C03_012E as Male_Private, S1401_C05_012E as Female_Private from acs_2018_staging.school_enrollment
where S1401_C03_011E is not null
order by NAME
limit 20

           NAME  Male_Public  Female_Public  Male_Private  Female_Private
0   ZCTA5 00601          215            147           150             533
1   ZCTA5 00602          512            794           604             918
2   ZCTA5 00603          615            704           774             830
3   ZCTA5 00606            5            173            72             132
4   ZCTA5 00610          344            480           422             508
5   ZCTA5 00612          685           1083           925            1499
6   ZCTA5 00616          133            204           190             258
7   ZCTA5 00617          386            372           342             506
8   ZCTA5 00622           83             97            87             114
9   ZCTA5 00623          411            972           235            1079
10  ZCTA5 00624          256            520           268             641
11  ZCTA5 00627          512            462           686             664
12  ZCTA5 00631           12              0             9               0
13  ZCTA5 00637          301            244           466             348
14  ZCTA5 00638           51            192           231             270
15  ZCTA5 00641          282            311           556             529
16  ZCTA5 00646          172            729           706             832
17  ZCTA5 00647          106             54           165              10
18  ZCTA5 00650          121            147           295             370
19  ZCTA5 00652            0             16            42             122

## Work

Summarize the work hours of each ZCTA area

In [18]:
%%bigquery
select NAME, S2303_C01_031E as Mean_hours, S2303_C01_032E as Median_age_working, S2303_C01_033E as Full_time_year_round from acs_2018_staging.work
where S2303_C01_031E is not null
order by NAME
limit 20

           NAME Mean_hours Median_age_working  Full_time_year_round
0   ZCTA5 00601       33.2               40.2                  2195
1   ZCTA5 00602       33.3               41.3                  6031
2   ZCTA5 00603       35.7               40.5                  7543
3   ZCTA5 00606       30.9               43.7                   689
4   ZCTA5 00610       33.9               38.9                  5209
5   ZCTA5 00612       34.8               40.3                  9688
6   ZCTA5 00616       34.6                 39                  1972
7   ZCTA5 00617       36.5               38.7                  3963
8   ZCTA5 00622       38.2                 43                  1036
9   ZCTA5 00623       34.8               42.6                  6681
10  ZCTA5 00624       33.1               41.8                  3642
11  ZCTA5 00627       34.2               40.1                  5356
12  ZCTA5 00631       33.1               39.4                   242
13  ZCTA5 00637       34.4               41.6                  3570
14  ZCTA5 00638       35.7               40.5                  2234
15  ZCTA5 00641       33.6               41.6                  3570
16  ZCTA5 00646       36.6               41.2                  8496
17  ZCTA5 00647       31.1               41.4                   464
18  ZCTA5 00650       32.7               40.2                  2451
19  ZCTA5 00652       34.3               36.4                   539

explore about the number of working hours for each ZCTA area

In [20]:
%%bigquery
select NAME, S2303_C01_009E as Work_35h_or_more, S2303_C01_016E as Work_16h_to_34h, S2303_C01_023E as Work_1h_to_15h, S2303_C01_030E as No_working from acs_2018_staging.work
where S2303_C01_016E is not null
order by NAME
limit 20

           NAME  Work_35h_or_more  Work_16h_to_34h  Work_1h_to_15h  No_working
0   ZCTA5 00601              2630             1084             275        6931
1   ZCTA5 00602              6806             4600             523       13476
2   ZCTA5 00603              9051             3559             495       17404
3   ZCTA5 00606               780              566              59        2802
4   ZCTA5 00610              5620             2831             437        8539
5   ZCTA5 00612             11233             4411             856       20742
6   ZCTA5 00616              2233              777             243        3819
7   ZCTA5 00617              4688             1488              69        8812
8   ZCTA5 00622              1080              156              11        2496
9   ZCTA5 00623              7150             3563             354       15290
10  ZCTA5 00624              4157             1749             449        8142
11  ZCTA5 00627              5789             2542             368       11978
12  ZCTA5 00631               253              164               0         510
13  ZCTA5 00637              3978             1593             347        8124
14  ZCTA5 00638              2454              847              85        6957
15  ZCTA5 00641              4360             1775             542       10740
16  ZCTA5 00646              9184             2255             587       12159
17  ZCTA5 00647               518              476              64        2081
18  ZCTA5 00650              2588             1178             363        5318
19  ZCTA5 00652               558              355              46        1306

the ratio between male and female who did not work

In [22]:
%%bigquery
select NAME, S2303_C03_030E as Male_no_working, S2303_C05_030E as Female_no_working from acs_2018_staging.work
where S2303_C03_030E is not null
order by NAME
limit 20

           NAME  Male_no_working  Female_no_working
0   ZCTA5 00601             3174               3757
1   ZCTA5 00602             5687               7789
2   ZCTA5 00603             7688               9716
3   ZCTA5 00606             1208               1594
4   ZCTA5 00610             3496               5043
5   ZCTA5 00612             8758              11984
6   ZCTA5 00616             1794               2025
7   ZCTA5 00617             3974               4838
8   ZCTA5 00622             1113               1383
9   ZCTA5 00623             6911               8379
10  ZCTA5 00624             3562               4580
11  ZCTA5 00627             4915               7063
12  ZCTA5 00631              259                251
13  ZCTA5 00637             3682               4442
14  ZCTA5 00638             3176               3781
15  ZCTA5 00641             4774               5966
16  ZCTA5 00646             5042               7117
17  ZCTA5 00647             1089                992
18  ZCTA5 00650             2082               3236
19  ZCTA5 00652              609                697